[Sentinel-API]
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1

[source::...ta_sentinelone*.log*]
sourcetype = ta:sentinelone:log

[groups]
KV_MODE=json
TIME_PREFIX = "_time":
MAX_TIMESTAMP_LOOKAHEAD = 30
EVAL-vendor_product = "SentinelOne"
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1

[source::...ta-sentinelone*.log*]
sourcetype = ta:sentinelone:log

[agents]
KV_MODE=json
TIME_PREFIX = "_time":
MAX_TIMESTAMP_LOOKAHEAD = 30
EVAL-cpu_cores = coreCount
EVAL-cpu_count = cpuCount
EVAL-description = "SentinelOne Agent (".if(osType == "macos","macOS" ,upper(substr(osType,1,1)).substr(osType,2) ).")"
EVAL-dest = computerName
EVAL-dest_host = computerName
EVAL-dest_name = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-dest_nt_domain = domain
EVAL-dest_user = lastLoggedInUserName
EVAL-dns = computerName.".".domain
EVAL-enabled = if(isActive == "true", "true", "false")
EVAL-family = osArch
EVAL-ip = 'networkInterfaces{}.inet{}'
EVAL-lastActive = lastActiveDate
EVAL-mac = 'networkInterfaces{}.physical'
EVAL-mem = totalMemory
EVAL-object_path = "https://".host.".".s1domain."/network/overview?filter=%7B%22query%22:%22".computerName."2%22%7D"
EVAL-os = osName." ".osRevision
EVAL-src_host = computerName
EVAL-src_ip = externalIp
EVAL-src_name = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-src_nt_domain = domain
EVAL-src_user = lastLoggedInUserName
EVAL-status = networkStatus.":".if(infected=="true","Infected","Healthy")
EVAL-time = updatedAt
EVAL-user = lastLoggedInUserName
EVAL-vendor_product = "SentinelOne Agent (".osType." ".agentVersion.")"
EVAL-version = agentVersion
FIELDALIAS-aob_gen_agents_alias_1 = computerName AS dest
FIELDALIAS-aob_gen_agents_alias_2 = osArch AS family
FIELDALIAS-aob_gen_agents_alias_23 = _name
FIELDALIAS-aob_gen_agents_alias_3 = uuid AS serial
FIELDALIAS-aob_gen_agents_alias_4 = agentVersion AS version
FIELDALIAS-aob_gen_agents_alias_49 = 'updated' AS action
FIELDALIAS-aob_gen_agents_alias_5 = cpuCount AS cpu_count
FIELDALIAS-aob_gen_agents_alias_50 = 'Endpoint' AS change_type
FIELDALIAS-aob_gen_agents_alias_51 = "SentinelOne Agent" AS object
FIELDALIAS-aob_gen_agents_alias_52 = uuid AS object_id
FIELDALIAS-aob_gen_agents_alias_6 = coreCount AS cpu_cores
FIELDALIAS-aob_gen_agents_alias_7 = totalMemory AS mem
FIELDALIAS-aob_gen_agents_alias_8 = lastLoggedInUserName AS user
FIELDALIAS-aob_gen_agents_alias_9 = updatedAt AS time
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1

[activities]
KV_MODE=json
TIME_PREFIX = "_time":
MAX_TIMESTAMP_LOOKAHEAD = 30
EVAL-action = "updated"
EVAL-change_type = "audit"
EVAL-command = primaryDescription
EVAL-domain = src_nt_domain
EVAL-dvc = if(isnull(data.computerName), host, data.computerName)
EVAL-file_hash = data.fileContentHash
EVAL-file_name = data.fileDisplayName
EVAL-file_path = data.filePath
EVAL-object = if(primaryDescription == "null", "SentinelOne Activity", primaryDescription)
EVAL-object_attrs = untable name key value
EVAL-object_category = activityType
EVAL-object_id = id
EVAL-object_path = if( secondaryDescription == "null","",  secondaryDescription)
EVAL-src_host = if(isnull('data.computerName')," ", 'data.computerName')
EVAL-src_name = siteName.data.computerName
EVAL-src_user = if(isnull(data.username), "sentinelone", data.username)
EVAL-status = if(match(primaryDescription,"(?i)\s(fail|failed|failure|error|err|unauthorized)\s") ,"failure" ,"success")
EVAL-user = if(isnull(data.username),  "sentinelone" , data.username)
EVAL-vendor_product = "SentinelOne Management ".data.buildVersion
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1

[threats]
KV_MODE=json
TIME_PREFIX = "_time":
MAX_TIMESTAMP_LOOKAHEAD = 30
EVAL-action = case(mitigationStatus=="mitigated", "blocked", mitigationStatus=="blocked", "blocked", resolved=="true", "allowed", true(), "deferred")
EVAL-app = "SentinelOne ".if(classificationSource == "Engine" OR classificationSource == "null" , "Agent" ,classificationSource )
EVAL-body = "SentinelOne Threat ".id." Mitigated:".mitigationStatus." Status:".action.if(resolved == "true", " Resolved ", " Unresolved ").description." is ".if('mitigationReport.kill.status' == "success", " Kill " , " ").if('mitigationReport.quarantine.status' == "success", " Quarantine", " ").if('mitigationReport.remediate.status' == "success" ," Remediate" ," ").if('mitigationReport.rollback.status' == "success" ," Rollback ", " ").if('mitigationReport.network_quarantine.status' == "success" ,"Network Disconnected", " ")
EVAL-category = classification
EVAL-date = updatedAt
EVAL-dest = agentComputerName
EVAL-dest_host = agentComputerName
EVAL-dest_nt_domain = agentDomain
EVAL-file_hash = fileContentHash
EVAL-file_name = fileDisplayName
EVAL-mitigationStatus = case( isnull(mitigation_status), mitigationStatus ,mitigation_status==0, "mitigated", mitigation_status==1, "active", mitigation_status==2, "blocked", mitigation_status==3, "suspicious", mitigation_status==4, "pending")
EVAL-product_version = agentOsType.agentVersion
EVAL-severity = if(action != "blocked" AND mitigationStatus != "mitigated" AND resolved != "true", "critical" ,if( mitigationStatus == "active" AND resolved != "true", "high",  if (mitigationStatus == "suspicious" OR mitigationStatus == "blocked", "medium", if (resolved=="true" ,"informational", "low"))))
EVAL-severity_id = if(action != "blocked" AND mitigationStatus != "mitigated" AND resolved != "true", 10 ,if( mitigationStatus == "active" AND resolved != "true", 7,  if (mitigationStatus == "suspicious" OR mitigationStatus == "blocked", 5, if (resolved=="true" ,1, 3))))
EVAL-signature = if( threatName == "null" and classification != "null", classification ,if( threatName != "null" and classification == "null", threatName, if(threatName != "null" and classification != "null", classification.".".threatName, " ")))
EVAL-signature_version = agentVersion
EVAL-src = agentComputerName
EVAL-src_host = agentComputerName
EVAL-src_name = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-src_nt_domain = domain
EVAL-src_user = lastLoggedInUserName
EVAL-subject = description
EVAL-time = updatedAt
EVAL-url = "https://".host.".".s1domain."/analyze/threats/".id."/overview"
EVAL-vendor_product = "SentinelOne"
FIELDALIAS-aob_gen_threats_alias_1 = classifierName AS category
FIELDALIAS-aob_gen_threats_alias_10 = agentIp AS dest_ip
FIELDALIAS-aob_gen_threats_alias_11 = updatedAt AS time
FIELDALIAS-aob_gen_threats_alias_2 = fileContentHash AS file_hash
FIELDALIAS-aob_gen_threats_alias_22 = username AS sender
FIELDALIAS-aob_gen_threats_alias_26 = 'Threat/Mitigation' AS change_type
FIELDALIAS-aob_gen_threats_alias_27 = 'SentinelOne' AS object
FIELDALIAS-aob_gen_threats_alias_28 = uuid AS object_id
FIELDALIAS-aob_gen_threats_alias_3 = filePath AS file_path
FIELDALIAS-aob_gen_threats_alias_4 = fileDisplayName AS file_name
FIELDALIAS-aob_gen_threats_alias_5 = username AS user
FIELDALIAS-aob_gen_threats_alias_6 = agentComputerName AS dest
FIELDALIAS-aob_gen_threats_alias_7 = agentDomain AS dest_nt_domain
FIELDALIAS-aob_gen_threats_alias_8 = updatedAt AS date
FIELDALIAS-aob_gen_threats_alias_9 = computerName AS dest_host
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1
